#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke/runs/run-DLq2BiAjEY5BY5Vn

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.run_id: Refreshing state... [id=r_Tr8w]
module.gke.random_id.node_pool_tag: Refreshing state... [id=IfRfJA]
module.gke.google_compute_router.router: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2/routers/gke-aff4ebf3-router]
module.gke.google_service_account.default: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/gke-aff4ebf3-sa@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.google_compute_firewall.gke_private_cluster_istio_gatekeeper_rules: Refreshing state... [id=projects/test-terraform-project-01/global/firewalls/honest-gke-aff4ebf3-private-cluster-allow]
module.gke.google_compute_router_nat.nat: Refreshing state... [id=test-terraform-project-01/asia-southeast2/gke-aff4ebf3-router/gke-aff4ebf3-nat]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3]
module.gke.google_container_node_pool.primary_node_pool: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3/nodePools/primary]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.gke.google_compute_firewall.gke_private_cluster_istio_gatekeeper_rules has been deleted
  - resource "google_compute_firewall" "gke_private_cluster_istio_gatekeeper_rules" {
      - creation_timestamp      = "2022-02-08T04:55:30.660-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/test-terraform-project-01/global/firewalls/honest-gke-aff4ebf3-private-cluster-allow" -> null
      - name                    = "honest-gke-aff4ebf3-private-cluster-allow" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/networks/vpc" -> null
      - priority                = 1000 -> null
      - project                 = "test-terraform-project-01" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/firewalls/honest-gke-aff4ebf3-private-cluster-allow" -> null
      - source_ranges           = [
          - "10.40.0.0/28",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "gke-primary-node-pool-21f45f24",
        ] -> null

      - allow {
          - ports    = [
              - "15017",
              - "8443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # module.gke.google_compute_router.router has been deleted
  - resource "google_compute_router" "router" {
      - creation_timestamp            = "2022-02-08T04:42:05.828-08:00" -> null
      - encrypted_interconnect_router = false -> null
      - id                            = "projects/test-terraform-project-01/regions/asia-southeast2/routers/gke-aff4ebf3-router" -> null
      - name                          = "gke-aff4ebf3-router" -> null
      - network                       = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/networks/vpc" -> null
      - project                       = "test-terraform-project-01" -> null
      - region                        = "asia-southeast2" -> null
      - self_link                     = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/regions/asia-southeast2/routers/gke-aff4ebf3-router" -> null
    }

  # module.gke.google_compute_router_nat.nat has been deleted
  - resource "google_compute_router_nat" "nat" {
      - drain_nat_ips                       = [] -> null
      - enable_endpoint_independent_mapping = true -> null
      - icmp_idle_timeout_sec               = 30 -> null
      - id                                  = "test-terraform-project-01/asia-southeast2/gke-aff4ebf3-router/gke-aff4ebf3-nat" -> null
      - min_ports_per_vm                    = 0 -> null
      - name                                = "gke-aff4ebf3-nat" -> null
      - nat_ip_allocate_option              = "AUTO_ONLY" -> null
      - nat_ips                             = [] -> null
      - project                             = "test-terraform-project-01" -> null
      - region                              = "asia-southeast2" -> null
      - router                              = "gke-aff4ebf3-router" -> null
      - source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES" -> null
      - tcp_established_idle_timeout_sec    = 1200 -> null
      - tcp_transitory_idle_timeout_sec     = 30 -> null
      - udp_idle_timeout_sec                = 30 -> null

      - log_config {
          - enable = true -> null
          - filter = "ERRORS_ONLY" -> null
        }
    }

  # module.gke.google_container_cluster.primary has changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3"
        name                        = "gke-aff4ebf3"
        # (28 unchanged attributes hidden)














      ~ node_pool {
          ~ instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroupManagers/gke-gke-aff4ebf3-primary-95aff105-grp",
                "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroupManagers/gke-gke-aff4ebf3-primary-7e55c430-grp",
              - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroupManagers/gke-gke-aff4ebf3-primary-693a9a7d-grp",
            ]
          ~ managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroups/gke-gke-aff4ebf3-primary-95aff105-grp",
                "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroups/gke-gke-aff4ebf3-primary-7e55c430-grp",
              - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroups/gke-gke-aff4ebf3-primary-693a9a7d-grp",
            ]
            name                        = "primary"
          ~ node_count                  = 1 -> 0
            # (4 unchanged attributes hidden)





            # (5 unchanged blocks hidden)
        }





        # (18 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.primary_node_pool has changed
  ~ resource "google_container_node_pool" "primary_node_pool" {
        id                          = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3/nodePools/primary"
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroupManagers/gke-gke-aff4ebf3-primary-95aff105-grp",
            "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroupManagers/gke-gke-aff4ebf3-primary-7e55c430-grp",
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroupManagers/gke-gke-aff4ebf3-primary-693a9a7d-grp",
        ]
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroups/gke-gke-aff4ebf3-primary-95aff105-grp",
            "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroups/gke-gke-aff4ebf3-primary-7e55c430-grp",
          - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroups/gke-gke-aff4ebf3-primary-693a9a7d-grp",
        ]
        name                        = "primary"
      ~ node_count                  = 1 -> 0
        # (7 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke.data.google_container_cluster.primary will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "primary"  {
      ~ addons_config                     = [
          - {
              - cloudrun_config                 = []
              - gcp_filestore_csi_driver_config = null
              - horizontal_pod_autoscaling      = [
                  - {
                      - disabled = false
                    },
                ]
              - http_load_balancing             = [
                  - {
                      - disabled = false
                    },
                ]
              - network_policy_config           = [
                  - {
                      - disabled = false
                    },
                ]
            },
        ] -> (known after apply)
      ~ authenticator_groups_config       = [
          - {
              - security_group = "gke-security-groups@honestbank.com"
            },
        ] -> (known after apply)
      ~ cluster_autoscaling               = [
          - {
              - auto_provisioning_defaults = []
              - enabled                    = false
              - resource_limits            = []
            },
        ] -> (known after apply)
      ~ cluster_ipv4_cidr                 = "10.20.0.0/16" -> (known after apply)
      ~ confidential_nodes                = [] -> (known after apply)
      ~ database_encryption               = [
          - {
              - key_name = ""
              - state    = "DECRYPTED"
            },
        ] -> (known after apply)
      + datapath_provider                 = (known after apply)
      ~ default_max_pods_per_node         = 110 -> (known after apply)
      ~ default_snat_status               = [
          - {
              - disabled = false
            },
        ] -> (known after apply)
      + description                       = (known after apply)
      ~ dns_config                        = [] -> (known after apply)
      ~ enable_autopilot                  = false -> (known after apply)
      ~ enable_binary_authorization       = true -> (known after apply)
      ~ enable_intranode_visibility       = true -> (known after apply)
      ~ enable_kubernetes_alpha           = false -> (known after apply)
      ~ enable_legacy_abac                = false -> (known after apply)
      ~ enable_shielded_nodes             = true -> (known after apply)
      ~ enable_tpu                        = false -> (known after apply)
      ~ endpoint                          = "34.101.130.22" -> (known after apply)
      ~ id                                = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3" -> (known after apply)
      ~ initial_node_count                = 1 -> (known after apply)
      ~ ip_allocation_policy              = [
          - {
              - cluster_ipv4_cidr_block       = "10.20.0.0/16"
              - cluster_secondary_range_name  = "honestcard-compute-pods-subnet"
              - services_ipv4_cidr_block      = "10.30.0.0/16"
              - services_secondary_range_name = "honestcard-compute-services-subnet"
            },
        ] -> (known after apply)
      ~ label_fingerprint                 = "5f106aed" -> (known after apply)
      ~ logging_config                    = [
          - {
              - enable_components = [
                  - "SYSTEM_COMPONENTS",
                  - "WORKLOADS",
                ]
            },
        ] -> (known after apply)
      ~ logging_service                   = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ maintenance_policy                = [] -> (known after apply)
      ~ master_auth                       = [
          - {
              - client_certificate        = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURvRENDQWdpZ0F3SUJBZ0lRYkY2bUdFU0svb3RJTFQ3NkRVOE52akFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSa01XVXlNbVUzTVMxaE5ERmhMVFE1TWpZdE9XUXdZaTFpWWpKak5ERXdPR00wTkRFdwpIaGNOTWpJd01qQTRNVEkwTWpBNFdoY05NamN3TWpBM01USTBNakE0V2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFDV3U2NUF6OTNLS3oxOTVScncKc1lNREcyNzNsTXY4aEp5RTNUN3V3VDRMMUVmVTZhRUVMYnFuOTRtekZWNktrdUFXT21paWZnaTV5c3pyK0piZApHMkYwcjAzOGxVWXFoQnIxbTRQMkJkeTVBSmRoMmhsMmR4ZjBtY0RSRXBYWS9rR3drVVQ0SGdYUGZaeitzaER2CjNPOVREZVBxOVJtdFl2eG9FUjZIKzJDb1MraEZJZDI4dDZOYm5vTUdjeGlCV3krSjFDdHVVODRGRjJRRkNIR1EKVFd6U3pBdGZZTnBieHhLeUwwNU1VeTlHcjZJbmg0aG9PcFBSRnFEMkpoVFB5UGwwQVprSWFQRnFEN0luOE5sRQppSUJBZGRoTTJTRE1xdWs4bU81azI0eHBPTms5M3pSRTdOWDFTVHQ0d0RmQ3NxdzViOVV3eFBranlVaXlnYUJTCnFEWnBBZ01CQUFHalZqQlVNQTRHQTFVZER3RUIvd1FFQXdJRm9EQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBTUJnTlZIUk1CQWY4RUFqQUFNQjhHQTFVZEl3UVlNQmFBRkxvOTFya2FTWkp1ZytIajNTR3hkN3ZOQmxNUgpNQTBHQ1NxR1NJYjNEUUVCQ3dVQUE0SUJnUUNmM2NGOHRKM2pvcmM5Y25EdDZRR1pnT051V0phYmJ3YlM2ZVRsCmQxT0hmZVdLbGhXRit3RHM4OHIzWk9RTFBqMFJES0M0UU91Ykd1YWV4OFN3clppL3FKTUdyemZlTDFkVjNYV3EKcC9hdnFkQjQ1b3Z5djJ4VTVlWHdrbDlmWUZBc3kxK094SkF3RSsyd3RxeWNGSlEyblVKZ1BJdEJiS2srb2NSRAo3Q3Z2aEY1RUhzRUVFTmtLNi85Z2huQXQ1bVY3aDRBVzhYSENLRUJJa0U0cDhRRXZHdWtJamQ5b3BWWTZ4clVlCkFTYjZ2QTgwYVhaQWNPL2prcGNYaVIyNGJsWU9DdFZZa0Q2c3lNUFk3Tk52ZklGQnNteWlCVmJkQmZTSUN5OGMKZ0VLbFJhYjJHNDMrT0xnT1dZUlJaZlVuTUZTdXh5YnIvUTN0SU85ZWRabi9WRzI1OGxGb2lkT28weE5zbUpGagpvb0szSFBybTdJajRVRjhKRjh0dVQwQUF5b1RmdzFrNVhncCt1bjN2ZGJoTDJxZjNOMFJzU0hQTTFVSnkxcXpVCnZacFBwVmZSdTlvOHNOM0ZWc2RJQlEwcHZqbUFNOGpSeUxRaGIrZVFGTEtXM04yaHRUTXk5UUJ6SFd0T0k5UjgKbEc1Ukp0RVVpWDhMOE5YdUlhNjAvYVZxTmdRPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_certificate_config = [
                  - {
                      - issue_client_certificate = true
                    },
                ]
              - client_key                = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFb2dJQkFBS0NBUUVBbHJ1dVFNL2R5aXM5ZmVVYThMR0RBeHR1OTVUTC9JU2NoTjArN3NFK0M5UkgxT21oCkJDMjZwL2VKc3hWZWlwTGdGanBvb240SXVjck02L2lXM1J0aGRLOU4vSlZHS29RYTladUQ5Z1hjdVFDWFlkb1oKZG5jWDlKbkEwUktWMlA1QnNKRkUrQjRGejMyYy9ySVE3OXp2VXczajZ2VVpyV0w4YUJFZWgvdGdxRXZvUlNIZAp2TGVqVzU2REJuTVlnVnN2aWRRcmJsUE9CUmRrQlFoeGtFMXMwc3dMWDJEYVc4Y1NzaTlPVEZNdlJxK2lKNGVJCmFEcVQwUmFnOWlZVXo4ajVkQUdaQ0dqeGFnK3lKL0RaUklpQVFIWFlUTmtnektycFBKanVaTnVNYVRqWlBkODAKUk96VjlVazdlTUEzd3JLc09XL1ZNTVQ1SThsSXNvR2dVcWcyYVFJREFRQUJBb0lCQURZalNaWlFzbTNDOHc2TgpJNHh3alVnbjZjYTFwRUJabHVmbm1RdGl6N2lxOFhQSXg4SzY4L0FSS2QxdTN1cHhqMWVjZWVsbTBCWisvdlAvCjhKdVFrb080MVE5VHhBUlFOMmlnaHhodGlaWE8zeEJQcDlhVE5zRHRHa0pkWlFHdmJJT1E0WThtSlZzZFdDNW8KWVVudGRlM0VMdWk4U0pFc1hOQzUyVmZvMHhJT3lDMjltT3I4TFJuNGducXFzNjNyNCtzRllBQnI5NVBUZlJETQpKNmtMWDhwYjl1N2E4cjFjSnIyZ2NUbE1ULzV1RHphcDEwMFMzTXAyam04MWZsdTM0UjJWaW1XYSs1RkpYYW15CjlmVk03TEgvaGFSd0k4T0NPWkVkbURRcm04amYrVDJ1a0JwZTBMZnBJRG5Wc1VvUVcxTDd0MHh6WThiT1BKaW8Kc2VWVzlRc0NnWUVBek5xcUpXa3BVcUlPNTd4dFN5TUwycmk4eklsMjZ5OTE3UVUxcHVpb3pqUWcyekFxY2VWNgpTTURWTU9KZnUrb3dDblJ3N0RwS0JQZ3BzT1NGRGJsVHJCMEN3VWlOQmFYRXQyR3Y1OXJCSnc3RGc3V2J3NDdTClh0eFZ1Z2JNTHBnaWhMZmJiaFRmWUw5dzROMXFVZUVpdjRsd24wbFgzV01EQzcxSjBkejArYXNDZ1lFQXZGM1oKUmpOR2lMdk9QRVZUNmZRL2t2Ti94ekh6YWxFTEN2ZUYxRmswMXdaTHhZc3lKaTUveGdONjM5cXZCYm1tS0JiMQp6eDMvMmREdStRQWRSRU1FNnpsbE1mT2xQeGE2Q3pabDdLbSsrVjVJOXROVXM1VTdxQU9xQ1laWE1OUkZZZy9xCnBIMWhZVWNwUGIrTzZ4N1Z1Z1k1cWpnSHQxOXFBR1JGNXFMa0JEc0NnWUJzeTcwTmZWcGE3b0tvQkdTdlFQK3MKdSt4WlhMQnhtNVV2dWxLU1FJSldjVXo1M0F6T3pLY3pPR2FCUGRqR1Brd2hZVklQdzYxSUVseGgvQnZGL0NVNgpCWFpQSEs3NHp0ODQzWUxFeW1ORzBRcDVTdHhjOGQ4OFRoeWhYYmJYRUNsVS95aGt3R1VhUnRJMk9xR2F0c3p6Cm1KVGRvK0FzVGNkeVZxZDc4N09QWFFLQmdIV256UG5iTnpoYXpqTzVQZlBJMnhqSHZVMUhkdm8yU3NaNzJ2ekwKQjRVemFvcW1LaG5OTzRRTVVtaVdhSElVQnFQTnk1V2w4RlExKzc1T0F2bkxQcnhLS2xvc0RGQSt1dEFjRjBmZQpzdW1CcWVONkZ0TGc2TlZHREtSTVpCT2Mwd1d3V1dpSzVCTmw1bTJxUS9PNlc5Y0k0bVhlLzNyYlB4T2xqai9FCkNOWlhBb0dBZE9aWXdVNUtpZUtJb0QrWDV6NzF0K2UyRVNDOFVucEsxYzgxWkc0Q01xcFJEWUtuZnoxWmVvNFUKZFU5VVo5TXBZaTF2V1N1U3NDc1hMSExkTldmQWo4c01jTi9CcWZiSGlXRXhseEtXQ1VDTk1GUmpRVml2VGZpWAplZ290Q0ZmZWVlWjZhcGd0eUlZbGI1b1lqNEl2WWVFRXNTemUrcm9RZlRkVlZqT3JBYXc9Ci0tLS0tRU5EIFJTQSBQUklWQVRFIEtFWS0tLS0tCg=="
              - cluster_ca_certificate    = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUt1YXNIT2FkK1hkdGpobmg0c1l5Tjh3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1pERmxNakpsTnpFdFlUUXhZUzAwT1RJMkxUbGtNR0l0WW1JeVl6UXhNRGhqTkRReApNQ0FYRFRJeU1ESXdPREV4TkRJd04xb1lEekl3TlRJd01qQXhNVEkwTWpBM1dqQXZNUzB3S3dZRFZRUURFeVJrCk1XVXlNbVUzTVMxaE5ERmhMVFE1TWpZdE9XUXdZaTFpWWpKak5ERXdPR00wTkRFd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDckxEd0Z4SWllelU2ZHc5S3hkL2V3NW0vMFBxQUdFa1krcldOMQpqYS94V0ZVTWR6WlYwZmJJN0VySUJjUTMrVVdwQ3F2NEdqZ0VwdHlMWFNzRVlZUG5HRExreitrVS9SaHFsVlMwClZHeEdQTHBjanpYbnlyU3RvTm5LRXl6ZktleXhLQ3oxNFdyaFZRZ3MycHJTby9zeVp6dC80cHd5S1J6ZFJmYnoKQmJDYllrOFdCK05VUGpOR29xQ3pPSWZVS1NxSkRKK3RvWUpoWHpNcGxnd0l3TEJBeGVrN3NtdG9IWWZWVDFEUApYc0ZhVjZEL2hLZStDWUJIckVuUE94YlNEcVh6dUNZMGxvZHNaYzlLOWN4ZHBSTkJxY1BPUlJ1Ylg1alhqR2pyCjVNdHFWK3YzQmdYQkNiemVJQm44S0NGei9mK3RRVGFVMyticS9tUE5ENkw0M1RNeW9JOHNaZFpwbDFDMVRuZmIKRXAwMzFqZ0ZMUmhTc0RRcnNUazM0Nk1QYTF6TGpEeEl0aytXeGJqOUpWcEJnNjJRU1l6RDBQZzhxUCtBbkdVMwpPWmU5VURPdytPRTlaWDZnVklyMS8raCtLbzNGRkptK3Jod2g4eTdiaVNKWTBxbTRJMHhBUTFIVzBFcUtLLzRFCmtwNXpSWVFFa2tUOTYwazJEMHY5WEZBY0dlMENBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGTG85MXJrYVNaSnVnK0hqM1NHeGQ3dk5CbE1STUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQVkzbEljS0UvR29VZEgyai9vMklQbURreDJFN1dVSHA1RE1EenE1NUlaCjl5aVI4R2VFVDl0aTFOUFc0OXQ4S0h2VFpYNVhsdXZwd1RhaUtrTzVNbUFzbXE0b2owWm1FQXY2RXNJWlM4c20KamREU3dTVXAyQU9JYTR4M0J1aEtqc1BXOUowTWMvS2hCTHp6ZnRjOG9ZUDJKN3E4YUJ5a2lWbjVaUXJtbWRqOAoyTFMrWjJFbktLMnpNVllyMzdaSnFQSVdrV000MERnTllkaUpNMHU0bkdKWWFiUzJYTVM2eFh5cjNxcFpCZjBhCklvZzBPdENkaENXamtMeDRYeEFMckc3UlFqZlpRR080RzVwU0haVHl6T0VYMGk5VXArZ3dDTEp4bWQwRlR6WkgKUVh3SWt0YTRzQnJXcU1NenFDZlY1dEFlZ1BMSjVBNXRlalZOQTRNM21KL1BnMHhsbkZrWXVoVSs5c1puYzU2QQpMZHpDYmI2VkRjaUhwbHFJMHppb3dSY0E1c2ZMQlVaaU84TVRYWGdSeTdUOVhKa0NYS1BQYTBWbnpZRW04WjR3CjRDUXhKUERRWHBLSVpnbmF5N3Myd3pxeWJ6NXZiNW9HWFBjeWlSd05GZzB4RzA0Qzk3ZFZrN2tPTnZrVnJEYksKVTZtR25CYk0zZzhnM0Q2aDJiZW1uZ1U9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      ~ master_authorized_networks_config = [
          - {
              - cidr_blocks = [
                  - {
                      - cidr_block   = "0.0.0.0/0"
                      - display_name = ""
                    },
                ]
            },
        ] -> (known after apply)
      ~ master_version                    = "1.21.6-gke.1500" -> (known after apply)
      + min_master_version                = (known after apply)
      ~ monitoring_config                 = [
          - {
              - enable_components = [
                  - "SYSTEM_COMPONENTS",
                ]
            },
        ] -> (known after apply)
      ~ monitoring_service                = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                              = "gke-aff4ebf3"
      ~ network                           = "projects/test-terraform-project-01/global/networks/vpc" -> (known after apply)
      ~ network_policy                    = [
          - {
              - enabled  = true
              - provider = ""
            },
        ] -> (known after apply)
      ~ networking_mode                   = "VPC_NATIVE" -> (known after apply)
      ~ node_config                       = [
          - {
              - boot_disk_kms_key        = ""
              - disk_size_gb             = 100
              - disk_type                = "pd-standard"
              - gcfs_config              = []
              - guest_accelerator        = []
              - image_type               = "COS_CONTAINERD"
              - labels                   = {}
              - local_ssd_count          = 0
              - machine_type             = "e2-standard-4"
              - metadata                 = {
                  - "disable-legacy-endpoints" = "true"
                }
              - min_cpu_platform         = ""
              - node_group               = ""
              - oauth_scopes             = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ]
              - preemptible              = false
              - service_account          = "gke-aff4ebf3-sa@test-terraform-project-01.iam.gserviceaccount.com"
              - shielded_instance_config = [
                  - {
                      - enable_integrity_monitoring = true
                      - enable_secure_boot          = true
                    },
                ]
              - tags                     = [
                  - "gke-primary-node-pool-21f45f24",
                ]
              - taint                    = []
              - workload_metadata_config = [
                  - {
                      - mode = "GKE_METADATA"
                    },
                ]
            },
        ] -> (known after apply)
      ~ node_locations                    = [
          - "asia-southeast2-a",
          - "asia-southeast2-b",
          - "asia-southeast2-c",
        ] -> (known after apply)
      ~ node_pool                         = [
          - {
              - autoscaling                 = [
                  - {
                      - max_node_count = 1
                      - min_node_count = 1
                    },
                ]
              - initial_node_count          = 1
              - instance_group_urls         = [
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroupManagers/gke-gke-aff4ebf3-primary-95aff105-grp",
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroupManagers/gke-gke-aff4ebf3-primary-7e55c430-grp",
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroupManagers/gke-gke-aff4ebf3-primary-693a9a7d-grp",
                ]
              - managed_instance_group_urls = [
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroups/gke-gke-aff4ebf3-primary-95aff105-grp",
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroups/gke-gke-aff4ebf3-primary-7e55c430-grp",
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroups/gke-gke-aff4ebf3-primary-693a9a7d-grp",
                ]
              - management                  = [
                  - {
                      - auto_repair  = true
                      - auto_upgrade = true
                    },
                ]
              - max_pods_per_node           = 110
              - name                        = "primary"
              - name_prefix                 = ""
              - node_config                 = [
                  - {
                      - boot_disk_kms_key        = ""
                      - disk_size_gb             = 100
                      - disk_type                = "pd-standard"
                      - gcfs_config              = []
                      - guest_accelerator        = []
                      - image_type               = "COS_CONTAINERD"
                      - labels                   = {}
                      - local_ssd_count          = 0
                      - machine_type             = "e2-standard-4"
                      - metadata                 = {
                          - "disable-legacy-endpoints" = "true"
                        }
                      - min_cpu_platform         = ""
                      - node_group               = ""
                      - oauth_scopes             = [
                          - "https://www.googleapis.com/auth/cloud-platform",
                        ]
                      - preemptible              = false
                      - service_account          = "gke-aff4ebf3-sa@test-terraform-project-01.iam.gserviceaccount.com"
                      - shielded_instance_config = [
                          - {
                              - enable_integrity_monitoring = true
                              - enable_secure_boot          = true
                            },
                        ]
                      - tags                     = [
                          - "gke-primary-node-pool-21f45f24",
                        ]
                      - taint                    = []
                      - workload_metadata_config = [
                          - {
                              - mode = "GKE_METADATA"
                            },
                        ]
                    },
                ]
              - node_count                  = 1
              - node_locations              = [
                  - "asia-southeast2-a",
                  - "asia-southeast2-b",
                  - "asia-southeast2-c",
                ]
              - upgrade_settings            = [
                  - {
                      - max_surge       = 1
                      - max_unavailable = 0
                    },
                ]
              - version                     = "1.21.6-gke.1500"
            },
        ] -> (known after apply)
      ~ node_version                      = "1.21.6-gke.1500" -> (known after apply)
      + operation                         = (known after apply)
      ~ private_cluster_config            = [
          - {
              - enable_private_endpoint     = false
              - enable_private_nodes        = true
              - master_global_access_config = [
                  - {
                      - enabled = false
                    },
                ]
              - master_ipv4_cidr_block      = "10.40.0.0/28"
              - peering_name                = "gke-n3adcc4fa55f7e7dc3c2-1fef-6b27-peer"
              - private_endpoint            = "10.40.0.2"
              - public_endpoint             = "34.101.130.22"
            },
        ] -> (known after apply)
      + private_ipv6_google_access        = (known after apply)
      - project                           = "test-terraform-project-01" -> null
      ~ release_channel                   = [
          - {
              - channel = "RAPID"
            },
        ] -> (known after apply)
      + remove_default_node_pool          = (known after apply)
      ~ resource_labels                   = {
          - "terraform" = "true"
        } -> (known after apply)
      ~ resource_usage_export_config      = [] -> (known after apply)
      ~ self_link                         = "https://container.googleapis.com/v1/projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3" -> (known after apply)
      ~ services_ipv4_cidr                = "10.30.0.0/16" -> (known after apply)
      ~ subnetwork                        = "projects/test-terraform-project-01/regions/asia-southeast2/subnetworks/honestcard-compute-primary-subnet" -> (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      ~ vertical_pod_autoscaling          = [] -> (known after apply)
      ~ workload_identity_config          = [
          - {
              - workload_pool = "test-terraform-project-01.svc.id.goog"
            },
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.gke.google_compute_firewall.gke_private_cluster_istio_gatekeeper_rules will be created
  + resource "google_compute_firewall" "gke_private_cluster_istio_gatekeeper_rules" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "honest-gke-aff4ebf3-private-cluster-allow"
      + network            = "projects/test-terraform-project-01/global/networks/vpc"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.40.0.0/28",
        ]
      + target_tags        = [
          + "gke-primary-node-pool-21f45f24",
        ]

      + allow {
          + ports    = [
              + "15017",
              + "8443",
            ]
          + protocol = "tcp"
        }
    }

  # module.gke.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-aff4ebf3-router"
      + network            = "projects/test-terraform-project-01/global/networks/vpc"
      + project            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
    }

  # module.gke.google_compute_router_nat.nat will be created
  + resource "google_compute_router_nat" "nat" {
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + name                                = "gke-aff4ebf3-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = (known after apply)
      + region                              = "asia-southeast2"
      + router                              = "gke-aff4ebf3-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.gke.google_container_node_pool.primary_node_pool will be updated in-place
  ~ resource "google_container_node_pool" "primary_node_pool" {
        id                          = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-aff4ebf3/nodePools/primary"
        name                        = "primary"
      ~ node_count                  = 0 -> 1
        # (9 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ client_token                                         = (sensitive value)
  ~ gke_cluster_istio_gatekeeper_firewall_rule_self_link = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/firewalls/honest-gke-aff4ebf3-private-cluster-allow" -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*